
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТЧ <> Неопределено Тогда
		РассчитатьСуммуВСтроке(СтрокаТЧ);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТЧ <> Неопределено Тогда
		РассчитатьСуммуВСтроке(СтрокаТЧ);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Рассчитать сумму в строке.
// 
// Параметры:
//  СтрокаТЧ - см. СтрокаТЧТовары
&НаКлиенте
Процедура РассчитатьСуммуВСтроке(СтрокаТЧ)
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
КонецПроцедуры

// Строка ТЧТовары.
// 
// Возвращаемое значение
// 	см. Документ.Продажа.Форма.ФормаДокумента.Элементы.Товары; 
&НаКлиенте
Функция СтрокаТЧТовары()
	Возврат Элементы.Товары.ТекущиеДанные;
КонецФункции

#КонецОбласти